'''
    Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
    Дано a, b, c — стороны предполагаемого треугольника.
    Требуется сравнить длину каждого отрезка-стороны с суммой двух других.
    Если хотя бы в одном случае отрезок окажется больше суммы двух других,
    то треугольника с такими сторонами не существует.
    Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.
'''

print('Введите стороны треугольника')
a = input('Сторона а: ')
b = input('Сторона b: ')
c = input('Сторона c: ')

if a < b + c and b < a + c and c < a + b:
    if a == b == c:
        print('Треугольник равностороний')
    elif a == b or a == c or b == c:
        print('Треугольник равнобедреный')
    else:
        print('Треугольник разностороний')

else:
    print('Увы это не тругольник')